-- Задача 2. Композитный индекс для дашборда
-- Запрос фильтрует status, диапазон order_date и группирует по user_id.
-- Подберите композитный индекс и объясните порядок колонок.
-- Время: ~23,6 мс → ~5,4 мс

create index idx_orders_stat_date_user on orders(status, order_date, user_id);

SELECT user_id, COUNT(*) AS orders
FROM orders
WHERE status = 'paid'
  AND order_date >= '2024-04-01'
  AND order_date <  '2024-07-01'
GROUP BY user_id
HAVING COUNT(*) >= 3;

-- Используем именно такой порядок колонок, чтобы сразу обратиться к непрерывному
-- количеству строк с статусом paid и оттуда выбрать диапазон подходящего месяца,
-- в противном случае мы бы выбрали месяц и смотрели статус каждого дня бы, что в разы
-- не выгоднее
