-- Задача 7. Индексный бюджет
-- Есть три частых запроса:
--   1. фильтр заказов по status + order_date;
--   2. последние события пользователя;
--   3. поиск событий по event_type + event_time.
-- Предложите не больше 3 индексов. Для каждого индекса напишите, какой запрос он ускоряет
-- и какой компромисс создаёт (запись/размер/обслуживание).

-- 1й индекс ускоряет запросы с where, где нужно сортировать по датам; компромисс - изменение
-- статуса заказа требует изменения записи в индексе. что дорого по памяти
create index idx_orders_status_date on orders(status, order_date);

-- 2й индекс позволяет быстро найти посединие действия пользователя, компромисс - аналогичная
-- ситуация с записью в индекс, ведь событий обычно самое большое количество по стркоам
-- в сравнении с другими таблицами
create index idx_user_time on events(user_id, event_time);

-- 3-й индекс ускряет запросы с where, где есть диапазон, компромисс - опять же, запись, размер
create index idx_events_type_time on events(event_type, event_time);
